export const removeMarkdown = (text: string): string => {
  return text
    .replace(/\*\*(.*?)\*\*/g, '$1') // Жирный текст: **текст**
    .replace(/\*(.*?)\*/g, '$1') // Курсив: *текст*
    .replace(/__(.*?)__/g, '$1') // Подчеркивание: __текст__
    .replace(/~~(.*?)~~/g, '$1') // Зачеркивание: ~~текст~~
    .replace(/`(.*?)`/g, '$1') // Код: `текст`
    .replace(/\[(.*?)\]\((.*?)\)/g, '$1') // Ссылки: [текст](url)
    .replace(/\n>/g, '\n') // Цитаты: > текст
    .replace(/!\[(.*?)\]\((.*?)\)/g, '$1'); // Изображения: ![alt](url)
};
